"""
Написати код (замість фрази #type your code here), який буде вирішувати таку задачу
Нехай день тижня задається змінною today, яка може набувати значень пн, вівт, сер, чт, пт, суб, нед.
Використовуючи case оператор вивести в консоль інформацію в форматі "today - будній день" або “today - вихідний день”, де today - це значення змінної today
У випадку якщо день тижня не відповідає зазначеним вище значенням (пн, вівт, сер, чт, пт, суб, нед) вивести в консоль за допомогою методу puts фразу 
"today - точно день тижня? Можна вводити тільки значення пн, вівт, сер, чт, пт, суб, нед", де today буде дорівнювати значенню змінної today.

Наприклад, для ь значення змінної today - ‘понеділок’
Результат: понеділок - точно день тижня? Можна вводити тільки значення пн, вівт, сер, чт, пт, суб, нед

Для значення змінної today - ‘суб’
Результат: суб - вихідний день 
"""

def workday(today)
    case today
    when "пн", "вівт", "сер", "чт", "пт" then puts(today + " - будній день")
    when "суб", "нед" then puts(today + " - вихідний день")
    else puts(today.to_s + " - точно день тижня? Можна вводити тільки значення пн, вівт, сер, чт, пт, суб, нед")
    end
end
      