"""
Створити змінну lambda1, в якій буде зберігатися лямбда-функція з таким функціоналом:

    функція буде повертати кількість розрядів в числі у випадку, якщо їх не більше 6
    якщо кількість цифр у числі буде дорівнювати як мінімум 6, то ця лямбда-функція повертає рядок 
    "Недопустима кількість розрядів. Число повинно бути не більше, ніж 5-розрядним"
"""

lambda1 = lambda { |num|
    num < 100000? num.to_s.length: "Недопустима кількість розрядів. Число повинно бути не більше, ніж 5-розрядним"
  }