"""
Написати клас Pizza.
Кожна піца буде характеризуватися своїм набором інгредієнтів (кожен інгредієнт - це просто рядок з назвою, набір - це масив таких рядків), діагоналлю та номером замовлення. Цей набір повинен зберігатися у змінній ingredients.
Кожній піці при створенні дається унікальний номер, який зберігається у змінній number (для цього треба створити змінну класу count, в яку записувати кількість створених екземплярів і використати її для цього номеру).
Діагональ зберігається у змінній d.
При створенні екземпляру класу задається тільки діагональ піци. Масив інгредієнтів при цьому створюється порожній.
Написати сетер для встановлення інгредієнтів.
Написати гетер для отримання діагоналі піци.
Заборонити можливість змінювати діагональ після створення піци.
Написати метод description, який повертав би рядкове представлення піци у вигляді
"""

class Pizza
    @@count = 0

    attr_accessor :number
    attr_writer :ingredients
    attr_reader :d

    def initialize(diagonal)
        @@count += 1
        @d = diagonal
        @ingredients = []
        @number = @@count
    end

    def description
        if @ingredients.is_a?(Array)
            ingredients_array = "[" + @ingredients.join(',') + "]"
            print "Піца № #{@number} (діагональ = #{@d}) містить #{ingredients_array}."
        else
            print "Піца № #{@number} (діагональ = #{@d}) містить #{@ingredients}."
        end
    end
end