financehub/app/views/reports/index.html.erb

SELECT "categories".* FROM "categories" WHERE (user_id = 5)
---
      <%= form.label :category_id, style: "display: block"%>
      <% categories_array = Category.all.where('user_id = ?', current_user.id).map { | cat | [cat.name, cat.id]} %>