"""
Використовуючи ключове слово retry написати метод third_order, який би просив користувача сказати, 
чому буде дорівнювати певне додатнє число, піднесене до 3 степеня (це число буде генеруватися за допомогою методу rand). 
Обов'язковим аргументом цього методу повинно бути число, яке задає верхню межу для числа, третій степінь якого треба буде знайти. 
Якщо користувач дасть правильну відповідь, то написати в консолі - Good job.
Інкаше - дати шанс ще раз дати відповідь для іншого числа. Таких шансів давати не більше трьох.
Якщо в результаті користувач не справиться з задачею, вивести в консоль повідомлення - Try next time.
"""

