"""
Створити змінну price, яка б містила ціну за кілограм цукерок (дійсне число).
Попросити користувача ввести з консолі ціну цукерок. Запрошення має бути у вигляді Введіть ціну цукерок для 1 кг.
Надайте змінній price значення, яке користувач введе з консолі.
Використовуючи метод times написати код, який би 5 разів просив користувача ввести в кг кількість цукерок (дійсне число), 
а у відповідь програма виводила б, скільки будуть коштувати ці цукерки.
Наприклад, діалог користувача з програмою може виглядати так (курсивом виділено текст, який вводить користувач:
Введіть ціну цукерок для 1 кг
85
Введіть в кг вагу цукерок, ціну яких Ви хочете дізнатися
1
85.0
Введіть в кг вагу цукерок, ціну яких Ви хочете дізнатися
2
170.0
Введіть в кг вагу цукерок, ціну яких Ви хочете дізнатися
0.5
42.5
Введіть в кг вагу цукерок, ціну яких Ви хочете дізнатися
10
850.0
Введіть в кг вагу цукерок, ціну яких Ви хочете дізнатися
7
595.0 
"""

puts("Введіть ціну цукерок для 1 кг")
price = gets.chomp.to_i

5.times do
    puts("Введіть в кг вагу цукерок, ціну яких Ви хочете дізнатися")
    amount = gets.chomp.to_f
    puts(price * amount)
end
