"""
Нехай ми хочемо перевірити, чи знає користувач, на які числа ділиться задане число, крім самого числа, що зберігається у змінній divider. 
Задайте цій змінній значення 21.

Написати програму, яка б просила ввести з консолі число, що ділиться на divider. Запрошення має бути у вигляді 
Введіть число, яке буде ділитися на divider : (замість divider має виводитися значення самої змінної). 

Користувач після запрошення має в тому ж рядку (згадайте, для чого метод print) ввести будь-яке число, що на його думку ділиться на divider.
Дати можливість вводити не більше 5 разів. Якщо користувач на протязі 5 разів неправильно введе число, то вивести інформацію, що кількість спроб закінчилася.
"""

divider = 21
count = 0

until count == 5
    print("Введіть число, яке буде ділитися на #{divider} : ")
    number = gets.chomp.to_i
    
    if number == divider
        puts("Число не повинно дорівнювати #{divider}")
        count += 1
        next
    end
    
    result = number % divider
    
    case result
        when 0 
            puts ("Чудово")
            break
        else 
            puts ("Невірно. Спробуйте ще раз")
    end
    
    count += 1
    
    if count == 5
        puts("Кількість спроб завершилася :(")
    end
end