financehub/app/views/operations/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <div class="col">
      <% categories_array = Category.all.map { | cat | [cat.name, cat.id]} %>