financehub/app/views/operations/_operation.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---

      <small><%= Category.find(operation.category_id).name %></small>