financehub/app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE (user_id = 5)
---
  def index
    @categories = Category.all