financehub/app/controllers/operations_controller.rb

SELECT "operations".* FROM "operations" WHERE (user_id = 5) LIMIT ? OFFSET ?  [["LIMIT", 9], ["OFFSET", 0]]
SELECT COUNT(*) FROM "operations" WHERE (user_id = 5)
---
  def index
    @operations = Operation.all.where('user_id = ?', current_user.id).page params[:page]

UPDATE "operations" SET "odate" = ?, "updated_at" = ? WHERE "operations"."id" = ?  [["odate", "1998-11-12 05:07:00"], ["updated_at", "2023-02-03 15:06:56.231174"], ["id", 9]]
---
  def update
    respond_to do |format|
      if @operation.update(operation_params)

DELETE FROM "operations" WHERE "operations"."id" = ?  [["id", 8]]
---
  def destroy
    @operation.destroy

SELECT "operations".* FROM "operations" WHERE "operations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_operation
      @operation = Operation.find(params[:id])