financehub/app/controllers/reports_controller.rb

SELECT "categories".* FROM "categories"
---
  def report_by_category
    @categories_outlay = {}
    @operations_outlay.map { |oper| @categories_outlay[oper.category.name] = 0.0 }
    @operations_outlay.map { |oper| @categories_outlay[oper.category.name] += oper.amount.to_f }

    @categories_income = {}
    if @operations_income.length.positive?
      @operations_income.map { |oper| @categories_income[oper.category.name] = 0.0 }
      @operations_income.map { |oper| @categories_income[oper.category.name] += oper.amount.to_f }

SELECT "operations".* FROM "operations" WHERE (odate > '1970-01-01') AND (odate < '2030-12-12') ORDER BY "operations"."odate" ASC
---
  def select_operations
    @operations = current_user.operations
                              .filter_by_start_date(params[:start_date])
                              .filter_by_final_date(params[:final_date])
                              .order(:odate)