financehub/app/controllers/reports_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def report_by_category
    @categories_outlay = {}
    @operations_outlay.all.map { | oper | @categories_outlay[(Category.find(oper.category_id)).name] = 0.0 }
    @operations_outlay.all.map { | oper | @categories_outlay[(Category.find(oper.category_id)).name] += oper.amount.to_f }


    @categories_income = {}
    if @operations_income.length > 0
      @operations_income.all.map { | oper | @categories_income[(Category.find(oper.category_id)).name] = 0.0 }
      @operations_income.all.map { | oper | @categories_income[(Category.find(oper.category_id)).name] += oper.amount.to_f }

SELECT "operations".* FROM "operations" WHERE (user_id = 5) AND (odate >= '1970-01-01') AND (odate <= '2030-12-12') AND (income = false) ORDER BY "operations"."odate" ASC
---
  def check_category_id_exists
    if params[:category_id] == ""
      @operations = Operation.all.where('user_id = ?', current_user.id)
                             .filter_by_start_date(params[:start_date])
                             .filter_by_final_date(params[:final_date]).order(:odate)
    else
      @operations = Operation.all.where('user_id = ?', current_user.id)
                             .filter_by_start_date(params[:start_date])
                             .filter_by_final_date(params[:final_date])
                             .filter_by_category_id(params[:category_id]).order(:odate)